---
kind: property
id: P:Autodesk.Revit.DB.TextNode.WidthScale
source: html/f25bba3a-c659-482e-db9e-0b965512a7b1.htm
---
# Autodesk.Revit.DB.TextNode.WidthScale Property

Scale applied to the width of the text.

## Syntax (C#)
```csharp
public double WidthScale { get; }
```